resources.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-06 Mon 18:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Resources</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
<div id="quote">Ashok Khanna</div>
<div id="home-link"><a href="/index.html">Home</a></div>
<div id="articles-link"><a href="/articles.html">Articles</a></div>
<div id="resources-link"><a href="/resources.html">Resources</a></div>
</div>
<div id="content">
<h1 class="title">Resources</h1>
<p>
Below are a collection of useful resources I found online. In many cases,
I will link directly to their websites, but also append an internal link for
an archived version that I store on this website to preserve these high quality
resources in the event there are taken down in the future.
</p>

<p>
All the resources below were freely available online at the time I found them.
If you are the author of any of the below and would like your resource removed
from the below listing, please kindly let me know and I will do so immediately. My aim
is to purely provide a platform to highlight the below resources, and not to profit
or otherwise benefit from any of them in any way.
</p>


<div id="outline-container-org6f0b066" class="outline-2">
<h2 id="org6f0b066">Common Lisp</h2>
<div class="outline-text-2" id="text-org6f0b066">
<ol class="org-ol">
<li><a href="file://https://clhs.ashok.jp">Common Lisp HyperSpec</a> - A mirror of the Common Lisp HyperSpec, as kindly
made available by <a href="https//www.lispworks.com">LispWorks</a> and the acclaimed <a href="http://www.nhplace.com">Kent Pitman</a>.</li>

<li><a href="https://lisp.ashok.jp">Common Lisp, the Language 2nd Edition</a> - A mirror of the venerable reference textbook
for Common Lisp, written by the acclaimed <a href="http://www.nhplace.com">Guy Steele</a>.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
